Revit 2027 API
ExportLayerTable.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo))
public:
virtual IEnumerator<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
Return Value
IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace